package Homeworks;

public class Encryption {
    public static void main(String[] args) {
        char c1 = 'И', c2 = 'Т', c3 = 'И', c4 = 'С'; // слово
        long k = 0x2DA295B3; // секретный ключ
        long m = 0; // число-сообщение, составленное из исходного слова
        // алгоритм упаковки слова в число:
        // каждый символ 16 бит, 4*16 = 64, значит 4 символа можно попробовать упаковать в long
        // первые слева 16 бит - 1 символ, 2-е 16 бит - 2-й символ, 3-е 16 бит - 3-й символ, 4-е 16 бит - 4-й символ
        // Это можно сделать с помощью битовых операций так, m = m | ((long) с1 << 48) - положили в нужное место первый символ
        // шифруем ...
        m = m | ((long) c1 << 48);
        m = m | ((long) c2 << 32);
        m = m | ((long) c3 << 16);
        m = m | (long) c4;

        m = m ^ k;
        System.out.println("Зашифрованное сообщение " + m);


        // дешифруем ...
        m = m ^ k;
        System.out.print("Расшифрованное сообщение ");
        for (int i = 3; i >= 0; i--){
            char sym = (char) (m >> 16 * i);
            System.out.print(sym);
        }



    }

}
